app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."user_id" = $1 ORDER BY COALESCE(release_date, '9999-12-31') ASC, pre_ordered_date ASC  [["user_id", 2]]
---
  def index
    @items = current_user.items
    .order(Arel.sql("COALESCE(release_date, '9999-12-31') ASC, pre_ordered_date ASC"))

SELECT "items".* FROM "items" WHERE "items"."user_id" = $1 AND "items"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 29], ["LIMIT", 1]]
---
  def show
    @item = current_user.items.find(params[:id])

INSERT INTO "items" ("name", "pre_ordered_date", "release_date", "price", "note", "created_at", "updated_at", "user_id", "pre_ordered_site_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "pre_ordered_sites" ("name", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "テストサイト"], ["url", nil], ["created_at", "2025-01-06 00:33:56.281750"], ["updated_at", "2025-01-06 00:33:56.281750"]]
SELECT "pre_ordered_sites".* FROM "pre_ordered_sites" WHERE "pre_ordered_sites"."name" = $1 LIMIT $2  [["name", "テストサイト"], ["LIMIT", 1]]
INSERT INTO "items" ("name", "pre_ordered_site_id", "pre_ordered_date", "release_date", "price", "note", "created_at", "updated_at", "user_id", "url") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    # 入力された予約サイト名を確認して処理
    pre_ordered_site = PreOrderedSite.find_or_create_by(name: params[:item][:pre_ordered_site_name])

    # アイテム作成処理
    @item = current_user.items.build(item_params)
    @item.pre_ordered_site_id = pre_ordered_site.id

    if @item.save

SELECT "items".* FROM "items" WHERE "items"."user_id" = $1 AND "items"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def edit
    @item = current_user.items.find(params[:id])

SELECT "items".* FROM "items" WHERE "items"."user_id" = $1 AND "items"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 28], ["LIMIT", 1]]
INSERT INTO "pre_ordered_sites" ("name", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "予約サイト"], ["url", nil], ["created_at", "2025-01-03 21:33:24.407372"], ["updated_at", "2025-01-03 21:33:24.407372"]]
SELECT "pre_ordered_sites".* FROM "pre_ordered_sites" WHERE "pre_ordered_sites"."name" = $1 LIMIT $2  [["name", "testsite"], ["LIMIT", 1]]
UPDATE "items" SET "updated_at" = $1, "url" = $2 WHERE "items"."id" = $3  [["updated_at", "2025-02-09 15:43:46.948696"], ["url", "https//example.com"], ["id", 30]]
---
  def update
    @item = current_user.items.find(params[:id])
    # 入力された予約サイト名を優先的に表示
    @pre_ordered_site_name = params[:item][:pre_ordered_site_name] || @item.pre_ordered_site.name

    # 予約サイト名を更新、または新規作成
    pre_ordered_site = PreOrderedSite.find_or_create_by(name: params[:item][:pre_ordered_site_name])
    @item.pre_ordered_site_id = pre_ordered_site.id

    # 他のカラムを更新
    if @item.update(item_params)

SELECT "items".* FROM "items" WHERE "items"."user_id" = $1 AND "items"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 26], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 26]]
---
  def destroy
    @item = current_user.items.find(params[:id])
    @item.destroy!